#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_availability_zones.available: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-002076565fb92f349]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0a680cb7399523277]
aws_security_group.rds: Refreshing state... [id=sg-0844b856e05901d0b]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0d77e379fad4e4b26]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-05aa73371afe7ec9d]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0119d1cea3db515c0]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0465612f8fe3fe234]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07e62a83b39bb1c8d]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0f165fa9b9972ef10]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-047a7551f3e580214]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-047a7551f3e5802141080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-058cd948948af53d6]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-029235c94ea5e92d6]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0bc8ea87a9018b423]
aws_db_subnet_group.fast_food_pedidos: Refreshing state... [id=fast_food_pedidos]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.fast_food_pedidos will be created
  + resource "aws_db_instance" "fast_food_pedidos" {
      + address                               = (known after apply)
      + allocated_storage                     = 5
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = "fast_food_pedidos"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "15.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "fast-food-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "fast-food-pedidos-parameter-group"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = (sensitive value)
      + vpc_security_group_ids                = [
          + "sg-0844b856e05901d0b",
        ]
    }

  # aws_db_parameter_group.fast_food_pedidos will be created
  + resource "aws_db_parameter_group" "fast_food_pedidos" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "postgres15"
      + id          = (known after apply)
      + name        = "fast-food-pedidos-parameter-group"
      + name_prefix = (known after apply)
      + tags_all    = (known after apply)

      + parameter {
          + apply_method = "immediate"
          + name         = "log_connections"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "rds.force_ssl"
          + value        = "0"
        }
    }

  # postgresql_database.fast_food_pedidos will be created
  + resource "postgresql_database" "fast_food_pedidos" {
      + allow_connections = true
      + connection_limit  = -1
      + encoding          = (known after apply)
      + id                = (known after apply)
      + is_template       = (known after apply)
      + lc_collate        = (known after apply)
      + lc_ctype          = (known after apply)
      + name              = (sensitive value)
      + owner             = (sensitive value)
      + tablespace_name   = (known after apply)
      + template          = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + rds_hostname = (sensitive value)
  + rds_port     = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @daniel-eiro, Action: `pull_request`*